{
  "source_video": "/sample-inputs/Boards App Walkthrough.mp4",
  "productInfo": {
    "name": "Boards",
    "description": "Boards empowers sales and marketing professionals to instantly access and share organized, on-brand content directly from their mobile keyboard across any messaging or social app.",
    "targetAudience": "Sales & Marketing Professionals, Sales & Marketing Managers",
    "competitors": []
  },
  "marketAnalysis": {
    "trend": "Most content management solutions are desktop-centric or lack deep mobile keyboard integration for instant, in-app sharing.",
    "insight": "Identify common pain points for sales and marketing professionals regarding mobile content access and sharing.; Find examples of successful mobile-first productivity tool ads, especially those leveraging in-app keyboard functionality."
  },
  "scripts": [
    {
      "id": 1,
      "title": "The Hamster's Existential Keyboard Crisis",
      "hook": "My sales rep forgot the link AGAIN. My tiny hamster heart can't take this!",
      "body": "A tiny hamster in a business suit dramatically weeps into a miniature espresso cup as a human sales rep fumbles for content on their phone. Suddenly, Boards appears, and the hamster's tears turn into an epic, triumphant roar, confetti exploding around it.",
      "callToAction": "Boards: Don't make the hamster cry."
    },
    {
      "id": 2,
      "title": "Corgi's Content Crusade: No Barks for Bad Boards!",
      "hook": "Woof woof! Your content strategy is... ruff. Let Professor Paws show you.",
      "body": "A highly intellectual Corgi wearing spectacles and a tiny tweed jacket lectures a room full of bewildered human sales managers about inconsistent content. It then flawlessly demonstrates Boards, barking approvals when content is consistent and giving disapproving growls at a 'bad' old workflow.",
      "callToAction": "Learn from Professor Paws. Get Boards."
    },
    {
      "id": 3,
      "title": "The Capybara's Chill: Surviving the Digital Deluge",
      "hook": "The internet is a wild place. My Zen is stronger than your chaotic DMs.",
      "body": "A capybara wearing tiny sunglasses sits serenely amidst a whirlwind of frantic notifications, flashing screens, and a human sales rep panicking. The capybara, unperturbed, calmly uses Boards on its tiny smartphone, effortlessly sharing content across multiple chaotic apps, maintaining peak chill.",
      "callToAction": "Find your Zen. Get Boards now."
    }
  ]
}